[
  {
    "journal": "Science (AAAS)",
    "article_type": "Research Article (standard)",
    "title_limit": "96 characters (including spaces)",
    "abstract_limit": "125 words or less",
    "word_limit": "3,000 words for the main text (standard Research Article)",
    "figure_limit": "3–5 display items (figures or tables) with brief legends",
    "reference_limit": "About 50 main‑text references",
    "structure": "Main text should be divided into sections with brief descriptive subheadings. Materials and Methods should be included in the supplementary materials and must provide sufficient detail to allow replication of the study. All data must be available in the main text, supplementary materials or a public repository and cited appropriately.",
    "other_requirements": "Research Articles not suitable for the print format (often those with more than four figures) will still appear online, with a one‑page summary (~500 words divided into Introduction, Rationale, Results and Conclusion) and a summary figure in the print version. The methods run after the main text, while additional data and figures remain in the supplementary materials. Authors should follow the general manuscript preparation guidelines (docx template, single spacing, figure preparation rules, etc.).",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Research Article (extended online)",
    "title_limit": "96 characters (including spaces)",
    "abstract_limit": "125 words or less",
    "word_limit": "Up to 6,000 words for the main text",
    "figure_limit": "Up to 6 display items (figures, tables or videos)",
    "reference_limit": "Up to 100 main‑text references; for meta‑analyses requiring more than 250 total references, authors should contact the editors before submission",
    "structure": "Same as standard Research Articles: main text divided into brief subheadings, methods section follows the main text, additional information in supplementary materials. A cover letter should explain why an extended format is merited.",
    "other_requirements": "Only a few Research Articles are granted the extended online format; authors must justify the need for additional length in the cover letter. Data availability and supplementary materials requirements remain the same.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Review",
    "title_limit": "Not specified (should be concise)",
    "abstract_limit": "Enhanced abstract of 500 words divided into ‘Background’, ‘Advances’ and ‘Outlook’, plus a summary figure (print version)",
    "word_limit": "Up to 5,500 words for the main text",
    "figure_limit": "4–6 display items (figures, boxes or tables)",
    "reference_limit": "Up to 150 references (with fewer than 20% referring to the authors’ own work)",
    "structure": "Reviews are authoritative syntheses of fields that have advanced over the past 3–5 years. They should not include unpublished data. Most Reviews are published online only; a summary appears in print.",
    "other_requirements": "Authorship is ideally 1–3 authors (no more than 7). Schematic figures should be created by the authors and not reproduced from elsewhere. Unsolicited review offers are considered. Reviews in special issues may have shorter lengths at the editors’ discretion.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Analytical Review",
    "title_limit": "Not specified (should be concise)",
    "abstract_limit": "Enhanced abstract of 550–600 words divided into ‘Background’, ‘Advances’ and ‘Outlook’, plus a summary figure",
    "word_limit": "Up to 6,000 words for the main text",
    "figure_limit": "4–6 display items (figures, boxes or tables)",
    "reference_limit": "Up to 150 references (no more than 20% referring to the authors’ own work)",
    "structure": "Analytical Reviews provide original analyses of published research from the past 3–5 years (no new data). They follow a similar structure to Reviews but may include original analysis of published data (formal meta‑analyses are considered original research).",
    "other_requirements": "Typically 1–3 authors (maximum 7). Schematic figures should be produced by authors. Enhanced abstract with 550–600 words and summary figure for print.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Policy Article",
    "title_limit": "Not specified",
    "abstract_limit": "Not specified",
    "word_limit": "2,000–3,000 words",
    "figure_limit": "1–2 figures",
    "reference_limit": "Up to 15 references",
    "structure": "Policy Articles present new, unpublished data and analyses that explore issues at the interface between science and society with policy implications.",
    "other_requirements": "Authors should follow standard submission guidelines; data must be available, and the article should draw upon existing work while presenting original analyses.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Perspective (linked to Science paper)",
    "title_limit": "Not specified",
    "abstract_limit": "Not required",
    "word_limit": "Approximately 1,000 words for Perspectives that comment on papers in the same issue; stand‑alone Perspectives are about 1,800 words",
    "figure_limit": "1 figure (stand‑alone Perspectives may include 1 table instead)",
    "reference_limit": "15 references",
    "structure": "Perspectives highlight recent and exciting research or emerging themes, adding context and interpretation. They should add a new dimension to the research and not simply describe what was done.",
    "other_requirements": "Linked Perspectives typically have no more than two authors. Stand‑alone Perspectives are invited or may be proposed and can be opinionated or historical. All data must be available as per Science’s policies.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Policy Forum",
    "title_limit": "Not specified",
    "abstract_limit": "Not specified",
    "word_limit": "2,000–3,000 words",
    "figure_limit": "1–2 figures",
    "reference_limit": "Up to 15 references",
    "structure": "Policy Forums draw on published work to explore issues related to science and society that have policy implications. They synthesise existing research and policy considerations.",
    "other_requirements": "Contributors should ensure a balanced perspective and adhere to Science’s data availability policies. These articles are often commissioned but unsolicited submissions are considered.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Book or Media Review",
    "title_limit": "Not specified",
    "abstract_limit": "Not applicable",
    "word_limit": "Up to 800 words",
    "figure_limit": "Not specified",
    "reference_limit": "Not specified",
    "structure": "Book or media reviews provide commentary on new books, films, exhibitions, performances, mobile apps, podcasts or other media likely to interest Science’s readership.",
    "other_requirements": "Unsolicited reviews should explain why the work would interest Science readers and why the author is well‑positioned to write the review. Reviews are subject to editorial acceptance and editing for clarity and length.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Letter",
    "title_limit": "Not specified",
    "abstract_limit": "Not applicable",
    "word_limit": "Up to 300 words",
    "figure_limit": "Usually none (embedded images are not allowed for eLetters)",
    "reference_limit": "Not specified (letters usually include minimal or no references)",
    "structure": "Letters discuss material published in Science within the past three months or issues related to recent events. They can be brief personal reflections, critiques or responses to published papers.",
    "other_requirements": "Letters should be submitted via the CTS portal. Authors of papers in question may be given the opportunity to reply. Letters may be edited for clarity and space. eLetters, posted online in response to articles, should not present new data and cannot include embedded images.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Science (AAAS)",
    "article_type": "Editorial or Expert Voice",
    "title_limit": "Not specified",
    "abstract_limit": "Not applicable",
    "word_limit": "Editorials: up to 720 words; Expert Voices: ~1,200 words",
    "figure_limit": "Not specified",
    "reference_limit": "Not specified",
    "structure": "Editorials are signed pieces (up to two authors) expressing compelling opinions on broadly interesting topics. Expert Voices provide conversational discussions on issues in a particular field and appear online only.",
    "other_requirements": "Most Editorials and Expert Voice pieces are solicited by the editors. Authors should adhere to Science’s guidelines on tone, data availability, and referencing.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Experimental & Molecular Medicine (Nature)",
    "article_type": "Research Article",
    "title_limit": "Not specified",
    "abstract_limit": "250 words",
    "word_limit": "6,000 words (excluding abstract, tables, figure legends and references)",
    "figure_limit": "Up to 8 display items (figures or tables)",
    "reference_limit": "60 references",
    "structure": "Manuscripts should follow the order: Title page, Abstract, Introduction, Materials and methods, Results, Discussion, Acknowledgements, Conflict of interest (if applicable), References, Appendices, Figure legends, Tables and Figures. Sections not applicable to a specific article type (e.g., Methods for Reviews) may be omitted【263830740099533†L171-L183】.",
    "other_requirements": "Research Articles may have no more than 3 co‑corresponding authors and 3 first authors【263830740099533†L169-L171】. A cover letter must accompany the submission stating that the work is original and not under consideration elsewhere; if previously reviewed by another journal, reviewer comments should be provided【263830740099533†L189-L197】.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Experimental & Molecular Medicine (Nature)",
    "article_type": "Review Article",
    "title_limit": "Not specified",
    "abstract_limit": "250 words",
    "word_limit": "6,000 words",
    "figure_limit": "Up to 8 display items (figures or tables)",
    "reference_limit": "100 references",
    "structure": "Reviews may include an Introduction (if applicable) and Main text followed by Acknowledgements, Conflict of interest (if applicable) and References. They provide a balanced overview accessible to researchers outside the speciality【263830740099533†L142-L153】.",
    "other_requirements": "Authors can submit proposals with outlines for editorial consideration. All Reviews are subject to peer review【263830740099533†L96-L105】.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Experimental & Molecular Medicine (Nature)",
    "article_type": "Correspondence",
    "title_limit": "Titles supplied by the editors",
    "abstract_limit": "Not applicable",
    "word_limit": "250–500 words",
    "figure_limit": "Not typically included",
    "reference_limit": "10 references",
    "structure": "Correspondence provides a forum for comments on previously published papers or topics of interest. It consists of a brief main text and, when applicable, conflict‑of‑interest statement and references【263830740099533†L108-L117】.",
    "other_requirements": "Correspondence pieces are reviewed by the editor and may be peer‑reviewed. In cases where the correspondence is critical of a previous paper, the authors of the original paper may be invited to reply【263830740099533†L108-L117】.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Cell Press STAR Methods",
    "article_type": "Methods Section (STAR Methods)",
    "title_limit": "Not applicable",
    "abstract_limit": "Not applicable",
    "word_limit": "No length limit for the methods section; authors should provide detailed procedures【458100624215742†L166-L170】",
    "figure_limit": "Not specified",
    "reference_limit": "Not specified",
    "structure": "The STAR Methods format divides the methods section into standard headings: Resource availability (Lead Contact, Materials availability, Data and Code availability), Experimental model and subject details (for life sciences papers), Method details, Quantification and statistical analysis, and Additional resources【458100624215742†L166-L193】. Authors must also include a Key Resources Table listing essential reagents and resources used in the study【458100624215742†L166-L170】.",
    "other_requirements": "STAR Methods emphasises reproducibility: methods have no length limit; authors must provide a Key Resources Table with resource identifiers and describe experimental procedures in detail. Authors should report results for all devices produced (not just the best example) and include means and standard deviations for physical sciences experiments【458100624215742†L166-L207】. Data and code should be made available.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Neuron (Cell Press)",
    "article_type": "Research Article / general",
    "title_limit": "Not specified",
    "abstract_limit": "A summary section is required at revision, but no specific word limit is given",
    "word_limit": "Not specified",
    "figure_limit": "Not specified",
    "reference_limit": "Not specified",
    "structure": "During the revision stage, Neuron manuscripts should include the following sections: Title, Author list, Author affiliations and footnotes, Contact information, Summary (abstract), Keywords, Introduction, Results, Discussion, Resource availability, Acknowledgements, Author contributions, Declaration of interests, Declaration of generative AI and AI‑assisted technologies, Supplemental information titles and legends, Figure titles and legends, Tables, STAR Methods, Resource identification initiative and References. These components ensure that the manuscript is fully described and reproducible.",
    "other_requirements": "Authors must comply with Neuron’s policies covering professional behaviour, preprint servers, related manuscripts, submission verification, duplicate submissions, authorship, competing interests, the declaration of generative AI use, data and image processing, human and animal studies, and more. Neuron uses the STAR Methods framework for detailed methods reporting and encourages pre‑submission inquiries and Cell Press multi‑journal submission. Presubmission inquiries require a title, an abstract and an explanation of why the paper is significant and broadly interesting.",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Proceedings of the National Academy of Sciences (PNAS)",
    "article_type": "Research Report",
    "title_limit": "Not specified",
    "abstract_limit": "Not specified",
    "word_limit": "Preferred length 6 pages (~4,000 words); up to 12 pages allowed",
    "figure_limit": "About 4 medium-size figures or tables",
    "reference_limit": "Around 50 references",
    "structure": "Reports describe original research of exceptional importance",
    "other_requirements": "May be Direct Submissions or Contributed submissions by NAS members",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Proceedings of the National Academy of Sciences (PNAS)",
    "article_type": "Brief Report",
    "title_limit": "Not specified",
    "abstract_limit": "Not specified",
    "word_limit": "3 pages (~1,600 words including title page and figure legends)",
    "figure_limit": "No additional tables or figures in SI; limited to essential data",
    "reference_limit": "15 references",
    "structure": "Observations of immediate impact; follow Direct Submission review",
    "other_requirements": "Published immediate open access and not eligible for member-contributed submissions",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Proceedings of the National Academy of Sciences (PNAS)",
    "article_type": "Letter to the Editor",
    "title_limit": "Not specified",
    "abstract_limit": "Not applicable",
    "word_limit": "500 words",
    "figure_limit": "Up to 2 figures or tables",
    "reference_limit": "10 references",
    "structure": "Brief comments addressing published PNAS articles",
    "other_requirements": "Must be submitted within six months of the article's publication; no supporting information",
    "last_accessed": "2025-07-26"
  },
  {
    "journal": "Proceedings of the National Academy of Sciences (PNAS)",
    "article_type": "Opinion",
    "title_limit": "Not specified",
    "abstract_limit": "Not required",
    "word_limit": "Approximately 1,500–2,000 words",
    "figure_limit": "Not specified",
    "reference_limit": "Not specified",
    "structure": "Succinct essays in the Front Matter section presenting a clearly articulated argument",
    "other_requirements": "Reviewed by at least one NAS member or expert; should address counter-arguments",
    "last_accessed": "2025-07-26"
  }
]
